In [259]:
import pandas as pd

In [261]:
initial_data = pd.read_csv('HR_comma_sep.csv')
initial_data.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,Department,salary
0,0.38,0.53,2,157,3,0,1,0,sales,low
1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,0.11,0.88,7,272,4,0,1,0,sales,medium
3,0.72,0.87,5,223,5,0,1,0,sales,low
4,0.37,0.52,2,159,3,0,1,0,sales,low

In [262]:
left = initial_data[initial_data.left==1]
left.shape

(3571, 10)

In [263]:
working = initial_data[initial_data.left==0]
working.shape

(11428, 10)

In [265]:
initial_data.groupby('left').mean()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,promotion_last_5years
left,,,,,,,
0,0.666810,0.715473,3.786664,199.060203,3.380032,0.175009,0.026251
1,0.440098,0.718113,3.855503,207.419210,3.876505,0.047326,0.005321

In [266]:
dummies_salary = pd.get_dummies(initial_data.salary,prefix='salary')

In [270]:
dummies_salary.head()

   salary_high  salary_low  salary_medium
0            0           1              0
1            0           0              1
2            0           0              1
3            0           1              0
4            0           1              0

In [268]:
initial_data.drop('salary',axis=1,inplace = True)

In [271]:
initial_data.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,Department
0,0.38,0.53,2,157,3,0,1,0,sales
1,0.80,0.86,5,262,6,0,1,0,sales
2,0.11,0.88,7,272,4,0,1,0,sales
3,0.72,0.87,5,223,5,0,1,0,sales
4,0.37,0.52,2,159,3,0,1,0,sales

In [273]:
data = initial_data[['satisfaction_level','average_montly_hours','promotion_last_5years']]

In [274]:
data

       satisfaction_level  average_montly_hours  promotion_last_5years
0                    0.38                   157                      0
1                    0.80                   262                      0
2                    0.11                   272                      0
3                    0.72                   223                      0
4                    0.37                   159                      0
...                   ...                   ...                    ...
14994                0.40                   151                      0
14995                0.37                   160                      0
14996                0.37                   143                      0
14997                0.11                   280                      0
14998                0.37                   158                      0

[14999 rows x 3 columns]

In [275]:
final_data = pd.concat([data,dummies_salary],axis=1)

In [277]:
final_data.head()

,satisfaction_level,average_montly_hours,promotion_last_5years,salary_high,salary_low,salary_medium
0,0.38,157,0,0,1,0
1,0.80,262,0,0,0,1
2,0.11,272,0,0,0,1
3,0.72,223,0,0,1,0
4,0.37,159,0,0,1,0

In [278]:
from sklearn.linear_model import LogisticRegression

In [279]:
model = LogisticRegression()

In [292]:
initial_data.head()

0    1
1    1
2    1
3    1
4    1
Name: left, dtype: int64

In [293]:
from sklearn.model_selection import train_test_split

In [308]:
X_train, X_test, y_train, y_test = train_test_split(final_data,initial_data,test_size=0.4)

In [309]:
model.fit(X_train,y_train)

LogisticRegression()

In [310]:
model.predict(X_test)

array([0, 1, 0, ..., 0, 0, 0], dtype=int64)

In [311]:
model.score(X_test,y_test)

0.7758333333333334